export const HANGEUL_CHOSEONG = ["ㄱ", "ㄲ", "ㄴ", "ㄷ", "ㄸ", "ㄹ", "ㅁ", "ㅂ", "ㅃ", "ㅅ", "ㅆ", "ㅇ", "ㅈ", "ㅉ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"];
export const HANGEUL_JUNGSEONG = ["ㅏ", "ㅐ", "ㅑ", "ㅒ", "ㅓ", "ㅔ", "ㅕ", "ㅖ", "ㅗ", "ㅘ", "ㅙ", "ㅚ", "ㅛ", "ㅜ", "ㅝ", "ㅞ", "ㅟ", "ㅠ", "ㅡ", "ㅢ", "ㅣ"];
export const HANGEUL_JONGSEONG = ["", "ㄱ", "ㄲ", "ㄳ", "ㄴ", "ㄵ", "ㄶ", "ㄷ", "ㄹ", "ㄺ", "ㄻ", "ㄼ", "ㄽ", "ㄾ", "ㄿ", "ㅀ", "ㅁ", "ㅂ", "ㅄ", "ㅅ", "ㅆ", "ㅇ", "ㅈ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"];

export const SSANGJAEUM = new Map([
    ["ㄲ", "ㄱ"],
    ["ㄸ", "ㄷ"],
    ["ㅃ", "ㅂ"],
    ["ㅆ", "ㅅ"],
    ["ㅉ", "ㅈ"]
]);
export const GYEOPBATCHIM = new Map([
    ["ㄲ", "ㄱㄱ"],
    ["ㄳ", "ㄱㅅ"],
    ["ㄵ", "ㄴㅈ"],
    ["ㄶ", "ㄴㅎ"],
    ["ㄺ", "ㄹㄱ"],
    ["ㄻ", "ㄹㅁ"],
    ["ㄼ", "ㄹㅂ"],
    ["ㄽ", "ㄹㅅ"],
    ["ㄾ", "ㄹㅌ"],
    ["ㄿ", "ㄹㅍ"],
    ["ㅀ", "ㄹㅎ"],
    ["ㅄ", "ㅂㅅ"],
    ["ㅆ", "ㅅㅅ"]
]);